content-org/all-posts.org
#+hugo_base_dir: ../
* DONE Text and Meaning in a Short Stay in Hell                       :books:
CLOSED: [2024-06-18]
:PROPERTIES:
:ID:       7BDB2149-533B-427A-9EAA-27E6EF44255E
:EXPORT_FILE_NAME: short-stay-in-hell
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :summary "Some thoughts on text and meaning in Steven Peck’s Novella, A Short Stay in Hell."
:END:

{{< warning >}}

** Spoilers
   :PROPERTIES:
   :CUSTOM_ID: spoilers
   :ID:       6B155A28-3C80-4692-BFC9-8D5C5D329893
   :END:
This post contains spoilers for Steven Peck's novella, /A Short Stay in
Hell./

{{< /warning >}}

A few months ago, I read /A Short Stay in Hell/ by Steven Peck. In the
novella, a Mormon, not having followed the one true religion of
Zoroastrianism, finds himself in Hell. His damnation isn't the typical
sort, however. What's atypical about this Hell is the possibility of
working one's way out. Rather than being subjected to the usual forms of
punishment, the damned are given a task to earn their exit.

Hell, it turns out, is an impossibly vast library, and those sent there
have to find a book that perfectly captures their life story. Each book
in the library is the same length and contains every possible
permutation of letters and punctuation, regardless of language or even
coherence. There is a book that is entirely comprised by the letter A,
one that is the comprised by all A's and only a single B, and so on.

The damned are given anything they would like to eat or drink, remain in
perfect health, are free to form relationships, and are given beds and
sheets. They can "die" but are simply respawned the next morning if they
do. They have infinite time to search the library, which is made up of
an unfathomable number of floors. Nothing compels them to search,
however, and thousands of years go by at times where the narrator is
simply doing other things.

What the novella plays with is that, on paper, Hell doesn't seem so bad.
There is no fire, no painful punishment at the hands of demons. But what
the reader sees in the story has less to do with the classical terror of
fire and brimstone and more to do with the existential horror of
possibility. The devastating quality is that everyone knows that Hell
/isn't/ infinite. Strangely, infinity is easier to conceive than the
fact that out of all possible combinations of letters there is a book
that describes your life and that you cannot leave until you find it.

Like Sartre's /No Exit,/ the horror also comes from other people. When a
cult forms and decides their "Godly" purpose is to inflict as much pain
as possible on others, the existential dread becomes more visceral.
Given that no one can permanently die but everyone still feels pain,
there are scenes in which people become captured by the cultists and are
simply tortured to death each day for thousands of years.

At one point, the narrator falls in love. This relationship goes on so
long that, at one point, the narrator mentions that they got bored and
just pretended they were animals for a few hundred years. When the
cultists eventually attempt to seize them, his love jumps over the
railing of the library (each floor is a perfect square with an
impossibly deep drop in the center), and the narrator never sees her
again.

There's an old /Twilight Zone/ episode that's hard not to think about
when reading /A Short Stay in Hell./ Truthfully, I don't remember the
finer points, but the major plot is this: a booklover is "imprisoned" in
a library where he will have to spend all of his time reading ("Yes!")
but he immediately breaks his glasses ("No!"). The stories have obvious
parallels but considering their differences points something out about
Peck's novella. In the /Twilight Zone/, the major disaster is /not/
being able to access the incredible amount of text that is contained in
a library when given infinite free time. In /A Short Stay in Hell/, the
horror is having that infinite free time and infinite text.

People often associate text and writing with meaning. But what is
fascinating about /A Short Stay in Hell/ is that the narrator is the
least happy and the least present when he is actively searching for his
life story. During the eras where he gives up his personal and
ultimately selfish attachment to finding his story, he has his happiest
moments. There is something interesting there.

