content/posts/short-stay-in-hell.md
+++
title = "Text and Meaning in a Short Stay in Hell"
author = ["Rick Wysocki"]
date = 2024-06-18T00:00:00-04:00
tags = ["books"]
draft = false
summary = "Here is my post summary."
+++

{{&lt; warning &gt;}}


## Spoilers {#spoilers}

This post contains spoilers for Steven Peck's novella, _A Short Stay in
Hell._

{{&lt; /warning &gt;}}

A few months ago, I read _A Short Stay in Hell_ by Steven Peck. In the
novella, a Mormon, not having followed the one true religion of
Zoroastrianism, finds himself in Hell. His damnation isn't the typical
sort, however. What's atypical about this Hell is the possibility of
working one's way out. Rather than being subjected to the usual forms of
punishment, the damned are given a task to earn their exit.

Hell, it turns out, is an impossibly vast library, and those sent there
have to find a book that perfectly captures their life story. Each book
in the library is the same length and contains every possible
permutation of letters and punctuation, regardless of language or even
coherence. There is a book that is entirely comprised by the letter A,
one that is the comprised by all A's and only a single B, and so on.

The damned are given anything they would like to eat or drink, remain in
perfect health, are free to form relationships, and are given beds and
sheets. They can "die" but are simply respawned the next morning if they
do. They have infinite time to search the library, which is made up of
an unfathomable number of floors. Nothing compels them to search,
however, and thousands of years go by at times where the narrator is
simply doing other things.

What the novella plays with is that, on paper, Hell doesn't seem so bad.
There is no fire, no painful punishment at the hands of demons. But what
the reader sees in the story has less to do with the classical terror of
fire and brimstone and more to do with the existential horror of
possibility. The devastating quality is that everyone knows that Hell
_isn't_ infinite. Strangely, infinity is easier to conceive than the
fact that out of all possible combinations of letters there is a book
that describes your life and that you cannot leave until you find it.

Like Sartre's _No Exit,_ the horror also comes from other people. When a
cult forms and decides their "Godly" purpose is to inflict as much pain
as possible on others, the existential dread becomes more visceral.
Given that no one can permanently die but everyone still feels pain,
there are scenes in which people become captured by the cultists and are
simply tortured to death each day for thousands of years.

At one point, the narrator falls in love. This relationship goes on so
long that, at one point, the narrator mentions that they got bored and
just pretended they were animals for a few hundred years. When the
cultists eventually attempt to seize them, his love jumps over the
railing of the library (each floor is a perfect square with an
impossibly deep drop in the center), and the narrator never sees her
again.

There's an old _Twilight Zone_ episode that's hard not to think about
when reading _A Short Stay in Hell._ Truthfully, I don't remember the
finer points, but the major plot is this: a booklover is "imprisoned" in
a library where he will have to spend all of his time reading ("Yes!")
but he immediately breaks his glasses ("No!"). The stories have obvious
parallels but considering their differences points something out about
Peck's novella. In the _Twilight Zone_, the major disaster is _not_
being able to access the incredible amount of text that is contained in
a library when given infinite free time. In _A Short Stay in Hell_, the
horror is having that infinite free time and infinite text.

People often associate text and writing with meaning. But what is
fascinating about _A Short Stay in Hell_ is that the narrator is the
least happy and the least present when he is actively searching for his
life story. During the eras where he gives up his personal and
ultimately selfish attachment to finding his story, he has his happiest
moments. There is something interesting there.
